TWilmer/s6e2ccx.ethernet/src/s6e2ccxj/s6e2ccxj.svd
        <!-- REGISTER "ADSS01" -->
        <register>
          <name>ADSS01</name>
          <description>Sampling Time Selection Register 0 and 1 [BHW]</description>
          <addressOffset>0x2C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TS15" -->
            <field>
              <name>TS15</name>
              <description>Bit15 of ADSS01</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS14" -->
            <field>
              <name>TS14</name>
              <description>Bit14 of ADSS01</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS13" -->
            <field>
              <name>TS13</name>
              <description>Bit13 of ADSS01</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS12" -->
            <field>
              <name>TS12</name>
              <description>Bit12 of ADSS01</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS11" -->
            <field>
              <name>TS11</name>
              <description>Bit11 of ADSS01</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS10" -->
            <field>
              <name>TS10</name>
              <description>Bit10 of ADSS01</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS9" -->
            <field>
              <name>TS9</name>
              <description>Bit9 of ADSS01</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS8" -->
            <field>
              <name>TS8</name>
              <description>Bit8 of ADSS01</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS7" -->
            <field>
              <name>TS7</name>
              <description>Bit7 of ADSS01</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS6" -->
            <field>
              <name>TS6</name>
              <description>Bit6 of ADSS01</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS5" -->
            <field>
              <name>TS5</name>
              <description>Bit5 of ADSS01</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS4" -->
            <field>
              <name>TS4</name>
              <description>Bit4 of ADSS01</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS3" -->
            <field>
              <name>TS3</name>
              <description>Bit3 of ADSS01</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS2" -->
            <field>
              <name>TS2</name>
              <description>Bit2 of ADSS01</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS1" -->
            <field>
              <name>TS1</name>
              <description>Bit1 of ADSS01</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TS0" -->
            <field>
              <name>TS0</name>
              <description>Bit0 of ADSS01</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADST01" -->
        <register>
          <name>ADST01</name>
          <description>Sampling Time Setup Register [BHW]</description>
          <addressOffset>0x30</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x1010</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STX0" -->
            <field>
              <name>STX0</name>
              <description>Sampling time N times setting bits</description>
              <msb>15</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ST0" -->
            <field>
              <name>ST0</name>
              <description>Sampling time setting bits</description>
              <msb>12</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "STX1" -->
            <field>
              <name>STX1</name>
              <description>Sampling time N times setting bits</description>
              <msb>7</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ST1" -->
            <field>
              <name>ST1</name>
              <description>Sampling time setting bits</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ADCT" -->
        <register>
          <name>ADCT</name>
          <description>Frequency Division Ratio Setup Register [BHW]</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x07</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CT" -->
            <field>
              <name>CT</name>
              <description>Frequency division ratio setting bits</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PRTSL" -->
        <register>
          <name>PRTSL</name>
          <description>Priority Conversion Timer Trigger Selection Register [BHW]</description>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PRTSL" -->
            <field>
              <name>PRTSL</name>
              <description>Priority conversion timer trigger selection bit</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
