TWilmer/s6e2ccx.ethernet/src/s6e2ccxj/s6e2ccxj.svd
        <!-- REGISTER "BREG29" -->
        <register>
          <name>BREG29</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x129</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG2A" -->
        <register>
          <name>BREG2A</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x12A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG2B" -->
        <register>
          <name>BREG2B</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x12B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG2C" -->
        <register>
          <name>BREG2C</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x12C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG2D" -->
        <register>
          <name>BREG2D</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x12D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG2E" -->
        <register>
          <name>BREG2E</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x12E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG2F" -->
        <register>
          <name>BREG2F</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x12F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG30" -->
        <register>
          <name>BREG30</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x130</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG31" -->
        <register>
          <name>BREG31</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x131</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG32" -->
        <register>
          <name>BREG32</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x132</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG33" -->
        <register>
          <name>BREG33</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x133</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG34" -->
        <register>
          <name>BREG34</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x134</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG35" -->
        <register>
          <name>BREG35</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x135</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG36" -->
        <register>
          <name>BREG36</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x136</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG37" -->
        <register>
          <name>BREG37</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x137</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG38" -->
        <register>
          <name>BREG38</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x138</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG39" -->
        <register>
          <name>BREG39</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x139</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG3A" -->
        <register>
          <name>BREG3A</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x13A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG3B" -->
        <register>
          <name>BREG3B</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x13B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG3C" -->
        <register>
          <name>BREG3C</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x13C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG3D" -->
        <register>
          <name>BREG3D</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x13D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG3E" -->
        <register>
          <name>BREG3E</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x13E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
