TWilmer/s6e2ccx.ethernet/src/s6e2ccxj/s6e2ccxj.svd
        <!-- REGISTER "BREG65" -->
        <register>
          <name>BREG65</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x165</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG66" -->
        <register>
          <name>BREG66</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x166</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG67" -->
        <register>
          <name>BREG67</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x167</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG68" -->
        <register>
          <name>BREG68</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x168</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG69" -->
        <register>
          <name>BREG69</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x169</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6A" -->
        <register>
          <name>BREG6A</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x16A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6B" -->
        <register>
          <name>BREG6B</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x16B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6C" -->
        <register>
          <name>BREG6C</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x16C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6D" -->
        <register>
          <name>BREG6D</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x16D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6E" -->
        <register>
          <name>BREG6E</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x16E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG6F" -->
        <register>
          <name>BREG6F</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x16F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG70" -->
        <register>
          <name>BREG70</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x170</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG71" -->
        <register>
          <name>BREG71</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x171</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG72" -->
        <register>
          <name>BREG72</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x172</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG73" -->
        <register>
          <name>BREG73</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x173</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG74" -->
        <register>
          <name>BREG74</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x174</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG75" -->
        <register>
          <name>BREG75</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x175</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG76" -->
        <register>
          <name>BREG76</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x176</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG77" -->
        <register>
          <name>BREG77</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x177</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG78" -->
        <register>
          <name>BREG78</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x178</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG79" -->
        <register>
          <name>BREG79</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x179</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG7A" -->
        <register>
          <name>BREG7A</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x17A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG7B" -->
        <register>
          <name>BREG7B</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x17B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
