TWilmer/s6e2ccx.ethernet/src/s6e2ccxj/s6e2ccxj.svd
        <!-- REGISTER "RX512TO1023OCTETS_GB" -->
        <register>
          <name>RX512TO1023OCTETS_GB</name>
          <description>Number of good and bad frames received with length between 512 and 1023 (inclusive) bytes exclusive of preamble. [BHW]</description>
          <addressOffset>0x1BC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RX1024TOMAXOCTETS_GB" -->
        <register>
          <name>RX1024TOMAXOCTETS_GB</name>
          <description>Number of good and bad frames received with length between 1024 and maxsize (inclusive) bytes exclusive of preamble [BHW]</description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXUNICASTFRAMES_G" -->
        <register>
          <name>RXUNICASTFRAMES_G</name>
          <description>Number of good unicast frames received [BHW]</description>
          <addressOffset>0x1C4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXLENGTHERROR" -->
        <register>
          <name>RXLENGTHERROR</name>
          <description>Number of frames received with length error (Length type field is not the frame size) for all frames with valid length field [BHW]</description>
          <addressOffset>0x1C8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXOUTOFRANGETYPE" -->
        <register>
          <name>RXOUTOFRANGETYPE</name>
          <description>Number of frames received with length/type field not equal to the valid frame size (Greater than 1500) [BHW]</description>
          <addressOffset>0x1CC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXPAUSEFRAMES" -->
        <register>
          <name>RXPAUSEFRAMES</name>
          <description>Number of good and valid PAUSE frames received [BHW]</description>
          <addressOffset>0x1D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXFIFOOVERFLOW" -->
        <register>
          <name>RXFIFOOVERFLOW</name>
          <description>Number of missed received frames due to FIFO overflow [BHW]</description>
          <addressOffset>0x1D4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXVLANFRAMES_GB" -->
        <register>
          <name>RXVLANFRAMES_GB</name>
          <description>Number of good and bad VLAN frames received [BHW]</description>
          <addressOffset>0x1D8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXWATCHDOGERROR" -->
        <register>
          <name>RXWATCHDOGERROR</name>
          <description>Number of frames received with error due to watchdog timeout error (frames with a data load larger than 2048 bytes) [BHW]</description>
          <addressOffset>0x1DC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "MMC_IPC_INTR_MASK_RX" -->
        <register>
          <name>MMC_IPC_INTR_MASK_RX</name>
          <description>MMC Receive Checksum Offload Interrupt Mask Register [BHW]</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BH" -->
            <field>
              <name>BH</name>
              <description>Higher bits of MMC_IPC_INTR_MASK_RX</description>
              <msb>29</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BL" -->
            <field>
              <name>BL</name>
              <description>Lower bits of MMC_IPC_INTR_MASK_RX</description>
              <msb>13</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MMC_IPC_INTR_RX" -->
        <register>
          <name>MMC_IPC_INTR_RX</name>
          <description>MMC Receive Checksum Offload Interrupt Register [BHW]</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BH" -->
            <field>
              <name>BH</name>
              <description>Higher bits of MMC_IPC_INTR_RX</description>
              <msb>29</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BL" -->
            <field>
              <name>BL</name>
              <description>Lower bits of MMC_IPC_INTR_RX</description>
              <msb>13</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXIPV4_GD_FRMS" -->
        <register>
          <name>RXIPV4_GD_FRMS</name>
          <description>Number of good IPv4 datagrams received with the TCP/UDP or ICMP payload [BHW]</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXIPV4_HDRERR_FRMS" -->
        <register>
          <name>RXIPV4_HDRERR_FRMS</name>
          <description>Number of IPv4 datagrams received with header errors (checksum/length or version mismatch) [BHW]</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXIPV4_NOPAY_FRMS" -->
        <register>
          <name>RXIPV4_NOPAY_FRMS</name>
          <description>Number of IPv4 datagram frames received that did not have a TCP/UDP or ICMP payload processed by the Checksum engine [BHW]</description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXIPV4_FRAG_FRMS" -->
        <register>
          <name>RXIPV4_FRAG_FRMS</name>
          <description>Number of good IPv4 datagrams with fragmentation [BHW]</description>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXIPV4_UDSBL_FRMS" -->
        <register>
          <name>RXIPV4_UDSBL_FRMS</name>
          <description>Number of good IPv4 datagrams received that had a UDP payload with checksum disabled [BHW]</description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "RXIPV6_GD_FRMS" -->
        <register>
          <name>RXIPV6_GD_FRMS</name>
          <description>Number of good IPv6 datagrams received with TCP/UDP or ICMP payloads [BHW]</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
